** TODO Incorporate Voluntary Migration Rates
The Final Report from DeWitt records the number of Japanese Americans who chose to voluntarily relocate away from the West Coast prior to the orders to relocate to Assembly Centers.

#+begin_src R :colnames yes
library(tidyverse)
read_csv("data/WDC-voluntary-migration.csv") |>
  arrange(desc(Total))
#+end_src

#+RESULTS:
| state      | county          | Total | Male | Female |
|------------+-----------------+-------+------+--------|
| California | Los Angeles     |  1969 | 1080 |    889 |
| California | Santa Clara     |   443 |  231 |    212 |
| Washington | King            |   403 |  183 |    220 |
| California | Alameda         |   263 |  142 |    121 |
| California | Monterey        |   234 |  143 |     91 |
| California | San Francisco   |   207 |   95 |    112 |
| California | Santa Barbara   |   205 |  116 |     89 |
| California | Fresno          |   153 |   75 |     78 |
| California | San Mateo       |   139 |   67 |     72 |
| California | Orange          |    88 |   54 |     34 |
| California | Imperial        |    82 |   35 |     47 |
| California | Santa Cruz      |    82 |   44 |     38 |
| California | Tulare          |    64 |   44 |     20 |
| California | San Diego       |    61 |   31 |     30 |
| Arizona    | Maricopa        |    58 |   34 |     24 |
| Washington | Pierce          |    56 |   26 |     30 |
| Oregon     | Multnomah       |    54 |   24 |     30 |
| Oregon     | Washington      |    50 |   32 |     18 |
| California | Ventura         |    29 |   14 |     15 |
| California | Sacramento      |    24 |   10 |     14 |
| California | San Joaquin     |    21 |   10 |     11 |
| California | Tuolumne        |    20 |   15 |      5 |
| California | Contra Costa    |    18 |    8 |     10 |
| California | Sonoma          |    17 |    9 |      8 |
| California | San Bernardino  |    13 |    9 |      4 |
| Oregon     | Hood River      |    13 |    9 |      4 |
| California | San Luis Obispo |    11 |    5 |      6 |
| California | Riverside       |    10 |    4 |      6 |
| California | Marin           |     8 |    4 |      4 |
| California | Stanislaus      |     8 |    4 |      4 |
| California | Butte           |     7 |    5 |      2 |
| California | Kern            |     7 |    5 |      2 |
| Washington | Yakima          |     7 |    4 |      3 |
| California | Merced          |     6 |    2 |      4 |
| California | San Benito      |     6 |    4 |      2 |
| Washington | Kitsap          |     6 |    4 |      2 |
| Washington | Lewis           |     6 |    1 |      5 |
| Washington | Thurston        |     6 |    2 |      4 |
| Oregon     | Polk            |     5 |    2 |      3 |
| Washington | Clark           |     5 |    3 |      2 |
| Washington | Pacific         |     5 |    2 |      3 |
| Oregon     | Lane            |     4 |    2 |      2 |
| California | Kings           |     3 |    1 |      2 |
| Washington | Okanogan        |     3 |    3 |        |
| California | Placer          |     2 |    1 |      1 |
| California | Yolo            |     2 |    2 |        |
| Oregon     | Yamhill         |     2 |      |      2 |
| Washington | Chelan          |     2 |    1 |      1 |
| California | Yuba            |     1 |      |      1 |
| Oregon     | Clatsop         |     1 |    1 |        |
